Revit 2020 API
Glazing Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class Glazing
Visual Basic
Public NotInheritable Class Glazing
Visual C++
public ref class Glazing abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Glazing
See Also
Glazing Members
Autodesk.Revit.DB.Visual Namespace